{"config": [{"config": {"b_constraint": null, "input_dtype": "float32", "output_dim": 500, "init": "glorot_uniform", "trainable": true, "input_dim": 784, "W_constraint": null, "bias": true, "activity_regularizer": null, "b_regularizer": null, "activation": "linear", "batch_input_shape": [null, 784], "name": "dense_1", "W_regularizer": null}, "class_name": "Dense"}, {"config": {"activation": "sigmoid", "name": "activation_1", "trainable": true}, "class_name": "Activation"}, {"config": {"b_constraint": null, "output_dim": 500, "init": "glorot_uniform", "trainable": true, "input_dim": null, "W_constraint": null, "bias": true, "activity_regularizer": null, "b_regularizer": null, "activation": "linear", "name": "dense_2", "W_regularizer": null}, "class_name": "Dense"}, {"config": {"activation": "sigmoid", "name": "activation_2", "trainable": true}, "class_name": "Activation"}, {"config": {"b_constraint": null, "output_dim": 500, "init": "glorot_uniform", "trainable": true, "input_dim": null, "W_constraint": null, "bias": true, "activity_regularizer": null, "b_regularizer": null, "activation": "linear", "name": "dense_3", "W_regularizer": null}, "class_name": "Dense"}, {"config": {"activation": "softmax", "name": "activation_3", "trainable": true}, "class_name": "Activation"}, {"config": {"b_constraint": null, "output_dim": 10, "init": "glorot_uniform", "trainable": true, "input_dim": null, "W_constraint": null, "bias": true, "activity_regularizer": null, "b_regularizer": null, "activation": "linear", "name": "dense_4", "W_regularizer": null}, "class_name": "Dense"}, {"config": {"activation": "softmax", "name": "activation_4", "trainable": true}, "class_name": "Activation"}, {"config": {"b_constraint": null, "input_dtype": "float32", "output_dim": 500, "init": "glorot_uniform", "trainable": true, "input_dim": 784, "W_constraint": null, "bias": true, "activity_regularizer": null, "b_regularizer": null, "activation": "linear", "batch_input_shape": [null, 784], "name": "dense_5", "W_regularizer": null}, "class_name": "Dense"}, {"config": {"activation": "relu", "name": "activation_5", "trainable": true}, "class_name": "Activation"}, {"config": {"b_constraint": null, "output_dim": 500, "init": "glorot_uniform", "trainable": true, "input_dim": null, "W_constraint": null, "bias": true, "activity_regularizer": null, "b_regularizer": null, "activation": "linear", "name": "dense_6", "W_regularizer": null}, "class_name": "Dense"}, {"config": {"activation": "relu", "name": "activation_6", "trainable": true}, "class_name": "Activation"}, {"config": {"b_constraint": null, "output_dim": 10, "init": "glorot_uniform", "trainable": true, "input_dim": null, "W_constraint": null, "bias": true, "activity_regularizer": null, "b_regularizer": null, "activation": "linear", "name": "dense_7", "W_regularizer": null}, "class_name": "Dense"}, {"config": {"activation": "softmax", "name": "activation_7", "trainable": true}, "class_name": "Activation"}], "class_name": "Sequential", "keras_version": "1.1.1"}